# Arithmetic and Data Alignment

### Integer Indexes

In [3]:
import pandas as pd
import numpy as np

In [6]:
ser = pd.Series(np.arange(3.))

In [7]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [8]:
ser[1]

1.0

In [9]:
ser[0]

0.0

In [11]:
ser[:-1]

0    0.0
1    1.0
dtype: float64

In [13]:
ser2 = pd.Series(np.arange(3.),index=['a',"b",'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [14]:
ser2[-1]

2.0

In [15]:
ser2.iloc[1]

1.0

In [16]:
ser2[:2]

a    0.0
b    1.0
dtype: float64

In [17]:
ser.loc[1]

1.0

In [18]:
s1 = pd.Series([1.3,-3.5,4.5,7],index=['a','c','d','e'])

In [19]:
s2=pd.Series([2,9.3,5.0,4.1,0.7],index=['a','c','e',"f",'g'])

In [20]:
s1

a    1.3
c   -3.5
d    4.5
e    7.0
dtype: float64

In [21]:
s2

a    2.0
c    9.3
e    5.0
f    4.1
g    0.7
dtype: float64

In [ ]:
# adding s1 and s2

In [22]:
s1+s2

a     3.3
c     5.8
d     NaN
e    12.0
f     NaN
g     NaN
dtype: float64

In [23]:
s1 * 2

a     2.6
c    -7.0
d     9.0
e    14.0
dtype: float64

In [25]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3),columns=list('bcd'),index=['ohio','texas','colorado'])

In [26]:
df2 = pd.DataFrame(np.arange(12.).reshape(4,3),columns=list('bde'),index=['Utha','ohio','texas','oregion'])

In [27]:
df1

            b    c    d
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0
colorado  6.0  7.0  8.0

In [28]:
df2

           b     d     e
Utha     0.0   1.0   2.0
ohio     3.0   4.0   5.0
texas    6.0   7.0   8.0
oregion  9.0  10.0  11.0

In [29]:
#adding two dataframes
df1+df2

            b   c     d   e
Utha      NaN NaN   NaN NaN
colorado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oregion   NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN

In [30]:
df1 = pd.DataFrame({"A":[1,2]})
df2=pd.DataFrame({"B":[3,4]})

In [31]:
df1

   A
0  1
1  2

In [32]:
df2

   B
0  3
1  4

In [33]:
# diffirence between 2 dataframe

In [34]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

# Arithmetic methods with fill values

In [38]:
df1 = pd.DataFrame(np.arange(12.).reshape(3,4),columns=list('abcd'))

In [39]:
df2=pd.DataFrame(np.arange(20.).reshape(4,5),columns=list('abcde'))

In [40]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [41]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [42]:
df2.loc[1,'b']=np.nan

In [43]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [44]:
# add two dataframe
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [45]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [46]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [47]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [53]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0